fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_Отпуска</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РазностьДат</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УчестьБольшойОтпуск</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_Отпуска/ВКМ_Отпуска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_Отпуска</name>
  <resources>
    <name>ДниФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДниПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ,Режим)
	
	//Проверка: нельзя проводить второй график отпусков на тот же год
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	График.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ВКМ_ГрафикОтпусков КАК График
	|ГДЕ
	|	Год(График.Год) = Год(&Год)
	|	И График.Проведен
	|	И График.Ссылка <> &ТекущийДок";

	Запрос.УстановитьПараметр("Год", Год);
	Запрос.УстановитьПараметр("ТекущийДок", Ссылка);

	Результат = Запрос.Выполнить();

	Если НЕ Результат.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю("График отпусков за " + Год(Год) + " год уже существует. Проведение отменено.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// регистр ВКМ_Отпуска
	Движения.ВКМ_Отпуска.Записывать = Истина;
	Для Каждого ТекСтрокаВКМ_ОтпускаСотрудников из ОтпускаСотрудников Цикл
		Движение = Движения.ВКМ_Отпуска.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Сотрудник = ТекСтрокаВКМ_ОтпускаСотрудников.Сотрудник;
		Движение.ДниФакт = 0;
		Движение.ДниПлан = ТекСтрокаВКМ_ОтпускаСотрудников.РазностьДат;
	КонецЦикла;
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	// Проверка пересечений отпусков
	Для Каждого Строка1 Из ОтпускаСотрудников Цикл
		Для Каждого Строка2 Из ОтпускаСотрудников Цикл
			Если Строка1 <> Строка2 Тогда
				
				Если Строка1.Сотрудник = Строка2.Сотрудник Тогда
					
					// Проверяем, пересекаются ли периоды
					Если (Строка1.ДатаНачала <= Строка2.ДатаОкончания) 
						И (Строка2.ДатаНачала <= Строка1.ДатаОкончания) Тогда
						
						ОбщегоНазначения.СообщитьПользователю("У сотрудника """ 
							+ Строка1.Сотрудник 
							+ """ пересекаются отпуска!");
						Отказ = Истина;
						Возврат;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
